Revit 2026 API
RebarContainer.AppendItemFromCurvesAndShape Method
Overload List
Name | Description
AppendItemFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation) | Obsolete.
AppendItemFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarTerminationOrientation, RebarTerminationOrientation)
Top
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace